---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.Conduit
zh: 线管
source: html/211cccd3-0c1b-08e4-8b76-7c1b05e62468.htm
---
# Conduit Methods

**中文**: 线管

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.